# FileManager language file - Spanish
# Copyright (C) 2024 Your Name or Company
# This file is distributed under the same license as Dolibarr

# Module info
Module500100Name=FileManager Pro
Module500100Desc=Sistema avanzado de gestión de archivos y copias de seguridad para Dolibarr

# Menu
FileManager=Administrador de Archivos
FileManagerMenu=Administrador de Archivos
FileManagerSetup=Configuración FileManager
FileManagerConfig=Configuración
FileManagerBackup=Copias de Seguridad
FileManagerLogs=Registros de Actividad

# Permissions
Permission500100=Acceder al FileManager
Permission500101=Crear y modificar archivos
Permission500102=Eliminar archivos
Permission500103=Gestionar copias de seguridad
Permission500104=Configurar FileManager

# Main interface
FileManagerDesc=Sistema de gestión de archivos y carpetas
FileManagerHome=Inicio
FileManagerCurrentPath=Ruta actual
FileManagerFiles=Archivos
FileManagerFolders=Carpetas
FileManagerAll=Todos
FileManagerRefresh=Actualizar
FileManagerSearch=Buscar
FileManagerSearchPlaceholder=Buscar archivos y carpetas...
FileManagerFilter=Filtrar
FileManagerSort=Ordenar
FileManagerNoResults=No se encontraron resultados
FileManagerLoading=Cargando...

# File properties
FileManagerName=Nombre
FileManagerDate=Fecha
FileManagerSize=Tamaño
FileManagerType=Tipo
FileManagerActions=Acciones
FileManagerProperties=Propiedades
FileManagerPermissions=Permisos

# Actions
FileManagerView=Ver
FileManagerViewFile=Ver archivo
FileManagerDownload=Descargar
FileManagerDownloadFile=Descargar archivo
FileManagerDownloadZip=Descargar como ZIP
FileManagerUpload=Subir
FileManagerUploadFiles=Subir archivos
FileManagerCreateFolder=Crear carpeta
FileManagerCreateNewFolder=Nueva carpeta
FileManagerRename=Renombrar
FileManagerCopy=Copiar
FileManagerCut=Cortar
FileManagerPaste=Pegar
FileManagerMove=Mover
FileManagerDelete=Eliminar
FileManagerDeleteFile=Eliminar archivo
FileManagerDeleteFolder=Eliminar carpeta
FileManagerDuplicate=Duplicar
FileManagerCompress=Comprimir
FileManagerExtract=Extraer
FileManagerShare=Compartir

# Trash
FileManagerTrash=Papelera
FileManagerTrashFolder=Carpeta papelera
FileManagerRecycleBin=Papelera de reciclaje
FileManagerMoveToTrash=Mover a papelera
FileManagerRestoreFromTrash=Restaurar de papelera
FileManagerEmptyTrash=Vaciar papelera
FileManagerPermanentlyDelete=Eliminar permanentemente

# Confirmations
FileManagerConfirm=Confirmar
FileManagerCancel=Cancelar
FileManagerSave=Guardar
FileManagerClose=Cerrar
FileManagerYes=Sí
FileManagerNo=No
FileManagerDeleteConfirmation=¿Está seguro de que desea eliminar este elemento?
FileManagerDeletePermanentlyConfirmation=¿Está seguro de que desea eliminar permanentemente este elemento? Esta acción no se puede deshacer.
FileManagerRestoreConfirmation=¿Está seguro de que desea restaurar este elemento?
FileManagerEmptyTrashConfirmation=¿Está seguro de que desea vaciar la papelera? Esta acción no se puede deshacer.

# Messages
FileManagerSuccess=Éxito
FileManagerError=Error
FileManagerWarning=Advertencia
FileManagerInfo=Información
FileManagerFileCreated=Archivo creado correctamente
FileManagerFolderCreated=Carpeta creada correctamente
FileManagerFileDeleted=Archivo eliminado correctamente
FileManagerFolderDeleted=Carpeta eliminada correctamente
FileManagerFileMoved=Archivo movido correctamente
FileManagerFolderMoved=Carpeta movida correctamente
FileManagerFileCopied=Archivo copiado correctamente
FileManagerFolderCopied=Carpeta copiada correctamente
FileManagerFileRenamed=Archivo renombrado correctamente
FileManagerFolderRenamed=Carpeta renombrada correctamente
FileManagerFileUploaded=Archivo subido correctamente
FileManagerFileDownloaded=Archivo descargado correctamente
FileManagerFileRestored=Archivo restaurado correctamente
FileManagerTrashEmptied=Papelera vaciada correctamente

# Errors
FileManagerErrorGeneric=Se produjo un error
FileManagerErrorPermission=Permiso denegado
FileManagerErrorNotFound=Archivo o carpeta no encontrado
FileManagerErrorAlreadyExists=Ya existe un archivo o carpeta con ese nombre
FileManagerErrorInvalidName=Nombre inválido
FileManagerErrorUploadFailed=Error al subir
FileManagerErrorDownloadFailed=Error al descargar
FileManagerErrorDeleteFailed=Error al eliminar
FileManagerErrorMoveFailed=Error al mover
FileManagerErrorCopyFailed=Error al copiar
FileManagerErrorRenameFailed=Error al renombrar
FileManagerErrorCreateFailed=Error al crear

# Sorting
FileManagerSortByName=Ordenar por nombre
FileManagerSortByDate=Ordenar por fecha
FileManagerSortBySize=Ordenar por tamaño
FileManagerSortAscending=Ascendente
FileManagerSortDescending=Descendente

# Filters
FileManagerShowAll=Mostrar todo
FileManagerShowFolders=Solo carpetas
FileManagerShowFiles=Solo archivos
FileManagerClearFilters=Limpiar filtros

# Pagination
FileManagerPage=Página
FileManagerOf=de
FileManagerItems=elementos
FileManagerSelected=seleccionados
FileManagerSelectAll=Seleccionar todo
FileManagerDeselectAll=Deseleccionar todo
FileManagerBack=Volver
FileManagerNext=Siguiente
FileManagerPrevious=Anterior
FileManagerFirst=Primero
FileManagerLast=Último

# Backup system
BackupSystem=Sistema de Copias de Seguridad
BackupDatabase=Copia de Base de Datos
BackupDatabaseDesc=Exportar todas las tablas SQL en formato comprimido
BackupFiles=Copia de Archivos
BackupFilesDesc=Comprimir todos los archivos de la instalación
BackupComplete=Copia Completa
BackupCompleteDesc=Base de datos + Archivos en un ZIP
BackupAutomatic=Copia Automática
BackupAutomaticDesc=Programar copias de seguridad automáticas
BackupManual=Copia Manual
BackupHistory=Historial de Copias
BackupDownload=Descargar Copia
BackupDelete=Eliminar Copia
BackupRestore=Restaurar Copia
BackupProgress=Progreso de la Copia
BackupCompleted=Copia completada
BackupFailed=Copia fallida
BackupCancelled=Copia cancelada
BackupInProgress=Copia en progreso
BackupStarting=Iniciando copia de seguridad...
BackupAnalyzing=Analizando...
BackupCompressing=Comprimiendo...
BackupFinalizing=Finalizando...
BackupViewLogs=Ver Registros

# Backup configuration
BackupEnabled=Habilitado
BackupDisabled=Deshabilitado
BackupFrequency=Frecuencia
BackupFrequencyDaily=Diario
BackupFrequencyWeekly=Semanal
BackupFrequencyMonthly=Mensual
BackupScheduleTime=Hora programada
BackupType=Tipo de copia
BackupLastBackup=Última copia
BackupNextBackup=Próxima copia
BackupNever=Nunca
BackupNotScheduled=No programado
BackupSaveConfig=Guardar configuración

# Backup logs
BackupLogTitle=Registro de Copia de Seguridad
BackupLogStarted=Copia de seguridad iniciada
BackupLogCompleted=Copia de seguridad completada exitosamente
BackupLogFailed=Copia de seguridad fallida
BackupLogCancelled=Copia de seguridad cancelada por el usuario
BackupLogProgress=Progreso: %s%%
BackupLogProcessing=Procesando: %s
BackupLogCreatingZip=Creando archivo ZIP...
BackupLogAddingFile=Añadiendo archivo: %s
BackupLogAddingTable=Añadiendo tabla: %s
BackupLogTableExported=Tabla exportada: %s (%s filas)
BackupLogFilesProcessed=Archivos procesados: %s de %s
BackupLogFoldersProcessed=Carpetas procesadas: %s
BackupLogSizeTotal=Tamaño total: %s
BackupLogDuration=Duración: %s
BackupLogError=Error: %s
BackupLogWarning=Advertencia: %s
BackupLogInfo=Info: %s
BackupLogSkipped=Omitido: %s
BackupLogFinished=Copia de seguridad finalizada a las %s
BackupLogSavedTo=Copia de seguridad guardada en: %s

# Backup analysis
BackupAnalysis=Análisis de Copia de Seguridad
BackupAnalysisDatabase=Análisis de Base de Datos
BackupAnalysisFiles=Análisis de Archivos
BackupAnalysisComplete=Análisis Completo
BackupAnalysisTables=Tablas a respaldar
BackupAnalysisRows=Filas totales
BackupAnalysisSize=Tamaño estimado
BackupAnalysisFiles=Archivos a respaldar
BackupAnalysisFolders=Carpetas a procesar
BackupAnalysisDuration=Duración estimada
BackupAnalysisConfirm=Confirmar e Iniciar Copia
BackupAnalysisCancel=Cancelar

# Backup status
BackupStatusIdle=Inactivo
BackupStatusRunning=Ejecutando
BackupStatusCompleted=Completado
BackupStatusFailed=Fallido
BackupStatusCancelled=Cancelado
BackupStatusWaiting=Esperando

# Setup page
SetupTitle=Configuración de FileManager
SetupGeneral=Configuración General
SetupBackup=Configuración de Copias
SetupSecurity=Configuración de Seguridad
SetupRootPath=Ruta raíz
SetupRootPathDesc=Directorio base para el explorador de archivos
SetupProtectedFolders=Carpetas protegidas
SetupProtectedFoldersDesc=Lista de carpetas protegidas separadas por comas
SetupMaxUploadSize=Tamaño máximo de subida
SetupMaxUploadSizeDesc=Tamaño máximo de archivo para subidas (en bytes)
SetupConfigSaved=Configuración guardada correctamente
SetupConfigError=Error al guardar la configuración

# Tab names
TabConfig=Configuración
TabBackup=Copias de Seguridad
TabLogs=Registros
TabMaintenance=Mantenimiento

# Stats
StatsTitle=Estadísticas
StatsTotalFiles=Total archivos
StatsTotalFolders=Total carpetas
StatsTotalSize=Tamaño total
StatsLastActivity=Última actividad
⌊匠汥捥楣돃⁮썭沺楴汰੥敳敬瑣慟汬匽汥捥楣湯牡琠摯੯敤敳敬瑣慟汬䐽獥汥捥楣湯牡琠摯੯敳敬瑣摥猽汥捥楣湯摡獯椊整獭摟汥瑥摥䔽敬敭瑮獯攠楬業慮潤ੳ瑩浥彳畣㵴汥浥湥潴⁳潣瑲摡獯椊整獭损灯敩㵤汥浥湥潴⁳潣楰摡獯搊汥瑥彥瑩浥彳潣普物㵭뿂汅浩湩牡笠潣湵絴攠敬敭瑮獯猠汥捥楣湯摡獯ਿ